#+TITLE: Emacs LISP notes

* splicing operator ,@
The Emacs ,@ operator perform splicing. It's similar to the * operator in Python

#+begin_src emacs-lisp :results output :exports both
  (setq b '(1 2 3))
  (print `(a ,b c))
  (print `(a ,@b c))
#+end_src

#+RESULTS:
: 
: (a (1 2 3) c)
: 
: (a 1 2 3 c)

#+begin_src python :results output :exports both
  b = [1, 2, 3]
  print(["a",  b, "c"])
  print(["a", *b, "c"])
#+end_src

#+RESULTS:
: ['a', [1, 2, 3], 'c']
: ['a', 1, 2, 3, 'c']

